zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
/*******************************************************************************
*                                 AMetal
*                       ----------------------------
*                       innovating embedded platform
*
* Copyright (c) 2001-2018 Guangzhou ZHIYUAN Electronics Co., Ltd.
* All rights reserved.
*
* Contact information:
* web site:    http://www.zlg.cn/
*******************************************************************************/

/**
 * \file
 * \brief STM32F103RBT6 GPIO 引脚配置参数定义
 *
 * \note: 配置引脚功能的时候一定要同时配置引脚的模式，如上下拉模式、推挽模式等
 *
 * \internal
 * \par Modification History
 * - 1.00 19-07-3  zc, first implementation
 * \endinternal
 */

#ifndef __STM32F103RBT6_PIN_H
#define __STM32F103RBT6_PIN_H

#ifdef __cplusplus
extern "C" {
#endif

#include "am_stm32f103rbt6_gpio_util.h"

 /**
 * \addtogroup stm32f103rbt6_if_pin
 * \copydoc stm32f103rbt6_pin.h
 * @{
 */

/**
 * \name STM32F103RBT6 GPIO 引脚编号
 * \anchor grp_gpio_pin_number
 * @{
 */

#define PIOA            0         /**< \brief 端口A引脚起始号 */
#define PIOA_0          0         /**< \brief PIOA_0 引脚号 */
#define PIOA_1          1         /**< \brief PIOA_1 引脚号 */
#define PIOA_2          2         /**< \brief PIOA_2 引脚号 */
#define PIOA_3          3         /**< \brief PIOA_3 引脚号 */
#define PIOA_4          4         /**< \brief PIOA_4 引脚号 */
#define PIOA_5          5         /**< \brief PIOA_5 引脚号 */
#define PIOA_6          6         /**< \brief PIOA_6 引脚号 */
#define PIOA_7          7         /**< \brief PIOA_7 引脚号 */
#define PIOA_8          8         /**< \brief PIOA_8 引脚号 */
#define PIOA_9          9         /**< \brief PIOA_9 引脚号 */
#define PIOA_10         10        /**< \brief PIOA_10 引脚号 */
#define PIOA_11         11        /**< \brief PIOA_11 引脚号 */
#define PIOA_12         12        /**< \brief PIOA_13 引脚号 */
#define PIOA_13         13        /**< \brief PIOA_13 引脚号 */
#define PIOA_14         14        /**< \brief PIOA_14 引脚号 */
#define PIOA_15         15        /**< \brief PIOA_15 引脚号 */

#define PIOB            16        /**< \brief 端口B引脚起始号 */
#define PIOB_0          16        /**< \brief PIOB_8 引脚号 */
#define PIOB_1          17        /**< \brief PIOB_1 引脚号 */
#define PIOB_2          18        /**< \brief PIOB_2 引脚号 */
#define PIOB_3          19        /**< \brief PIOB_3 引脚号 */
#define PIOB_4          20        /**< \brief PIOB_4 引脚号 */
#define PIOB_5          21        /**< \brief PIOB_5 引脚号 */
#define PIOB_6          22        /**< \brief PIOB_3 引脚号 */
#define PIOB_7          23        /**< \brief PIOB_4 引脚号 */
#define PIOB_8          24        /**< \brief PIOB_5 引脚号 */
#define PIOB_9          25        /**< \brief PIOB_5 引脚号 */
#define PIOB_10         26        /**< \brief PIOB_10引脚号 */
#define PIOB_11         27        /**< \brief PIOB_11引脚号 */
#define PIOB_12         28        /**< \brief PIOB_12引脚号 */
#define PIOB_13         29        /**< \brief PIOB_13引脚号 */
#define PIOB_14         30        /**< \brief PIOB_14引脚号 */
#define PIOB_15         31        /**< \brief PIOB_15引脚号 */

#define PIOC            32        /**< \brief 端口C引脚起始号 */
#define PIOC_0          32        /**< \brief PIOC_13引脚号 */
#define PIOC_1          33        /**< \brief PIOC_13引脚号 */
#define PIOC_2          34        /**< \brief PIOC_13引脚号 */
#define PIOC_3          35        /**< \brief PIOC_13引脚号 */
#define PIOC_4          36        /**< \brief PIOC_13引脚号 */
#define PIOC_5          37        /**< \brief PIOC_13引脚号 */
#define PIOC_6          38        /**< \brief PIOC_13引脚号 */
#define PIOC_7          39        /**< \brief PIOC_13引脚号 */
#define PIOC_8          40        /**< \brief PIOC_13引脚号 */
#define PIOC_9          41        /**< \brief PIOC_13引脚号 */
#define PIOC_10         42        /**< \brief PIOC_13引脚号 */
#define PIOC_11         43        /**< \brief PIOC_13引脚号 */
#define PIOC_12         44        /**< \brief PIOC_13引脚号 */
#define PIOC_13         45        /**< \brief PIOC_13引脚号 */
#define PIOC_14         46        /**< \brief PIOC_14引脚号 */
#define PIOC_15         47        /**< \brief PIOC_15引脚号 */

#define PIOD            48        /**< \brief 端口D引脚起始号 */
#define PIOD_0          48        /**< \brief PIOD_0引脚号 */
#define PIOD_1          49        /**< \brief PIOD_1引脚号 */
#define PIOD_2          50        /**< \brief PIOD_2引脚号 */

/**
 * \brief 引脚数目为51
 */
#define PIN_NUM         51

/**
 * \brief 支持同时发生最大引脚中断数是16
 */
#define PIN_INT_MAX     16

/** @} */

/**
 * \name STM32F103RBT6 引脚定义,除调试引脚SWCK、SWIO之外，所有引脚复位时都默认为GPIO功能(浮空输入)
 * @{
 */

/******************************************************************************/
/**
 * \brief TIM5CH4 与 LSI 相连   ADC的规则和注入转换宏

 */

#define TIM5_CH4_LSI_REMAP1                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x10, 1)   /**< \brief TIM5_CH4_LSI */
#define ADC1_ETRGINJ_REMAP0                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x11, 0)   /**< \brief EXTI15 */
#define ADC1_ETRGINJ_REMAP1                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x11, 1)   /**< \brief TIM8_CH4 */
#define ADC1_ETRGREG_REMAP0                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x12, 0)   /**< \brief EXTI11 */
#define ADC1_ETRGREG_REMAP1                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x12, 1)   /**< \brief TIM8_TRGO */
#define ADC2_ETRGINJ_REMAP0                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x13, 0)   /**< \brief EXTI15 */
#define ADC2_ETRGINJ_REMAP1                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x13, 1)   /**< \brief TIM8_CH4 */
#define ADC2_ETRGREG_REMAP0                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x14, 0)   /**< \brief EXTI11 */
#define ADC2_ETRGREG_REMAP1                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x14, 1)   /**< \brief TIM8_TRGO */
/**
 * \name PIOA_0引脚复用功能
 * @{
 */
#define PIOA_0_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOA_0_ADC12_IN0             PIOA_0_NO_REMAP   /**< \brief ADC12_IN0 */
#define PIOA_0_WKUP                  PIOA_0_NO_REMAP   /**< \brief WAKE_UP */
#define PIOA_0_GPIO                  PIOA_0_NO_REMAP   /**< \brief GPIO */

#define PIOA_0_USART2_CTS_REMAP0     AM_STM32F103RBT6_GPIO_REMAP_CODE(0x03, 0)   /**< \brief USART2_CTS */
#define PIOA_0_TIM2_CH1_ETR_REMAP0   AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 0)   /**< \brief TIM2_CH1_ETR */
#define PIOA_0_TIM2_CH1_ETR_REMAP2   AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH1_ETR */

/** @} */

/**
 * \name PIOA_0引脚复用时功能模式
 * @{
 */

#define PIOA_0_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_0_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_0_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_0_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_0_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_0_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_0_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_0_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_0引脚响应速率
 * @{
 */

#define PIOA_0_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOA_0_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOA_0_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_1引脚复用功能
 * @{
 */
#define PIOA_1_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOA_1_ADC12_IN1             PIOA_1_NO_REMAP   /**< \brief ADC12_IN1 */
#define PIOA_1_GPIO                  PIOA_1_NO_REMAP   /**< \brief GPIO */

#define PIOA_1_TIM2_CH2_REMAP0       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 0)   /**< \brief TIM2_CH2 */
#define PIOA_1_TIM2_CH2_REMAP2       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH2 */
#define PIOA_1_USART2_RTS_REMAP0     AM_STM32F103RBT6_GPIO_REMAP_CODE(0x03, 0)   /**< \brief USART2_RTS */

/** @} */

/**
 * \name PIOA_1引脚复用时功能模式
 * @{
 */

#define PIOA_1_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_1_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_1_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_1_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_1_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_1_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_1_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_1_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_1引脚响应速率
 * @{
 */

#define PIOA_1_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOA_1_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOA_1_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_2引脚复用功能
 * @{
 */
#define PIOA_2_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOA_2_ADC12_IN2             PIOA_2_NO_REMAP   /**< \brief ADC12_IN2 */
#define PIOA_2_GPIO                  PIOA_2_NO_REMAP   /**< \brief GPIO */

#define PIOA_2_TIM2_CH3_REMAP0       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 0)   /**< \brief TIM2_CH3 */
#define PIOA_2_TIM2_CH3_REMAP1       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH3 */
#define PIOA_2_USART2_TX_REMAP0      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x03, 0)   /**< \brief USART2_RTS */


/** @} */

/**
 * \name PIOA_2引脚复用时功能模式
 * @{
 */

#define PIOA_2_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_2_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_2_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_2_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_2_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_2_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_2_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_2_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_2引脚响应速率
 * @{
 */

