zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
#define PIOA_12_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOA_12_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOA_12_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_13引脚复用功能
 * @{
 */
#define PIOA_13_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOA_13_GPIO                  PIOA_13_NO_REMAP   /**< \brief GPIO */

#define PIOA_13_SWDIO                 AM_STM32F103RBT6_GPIO_REMAP_CODE(0x18, 0)   /**< \brief SWDIO */
/** @} */

/**
 * \name PIOA_13引脚复用时功能模式
 * @{
 */

#define PIOA_13_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_13_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_13_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_13_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_13_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_13_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_13_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_13_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_13引脚响应速率
 * @{
 */

#define PIOA_13_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOA_13_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOA_13_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_14引脚复用功能
 * @{
 */
#define PIOA_14_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOA_14_GPIO                  PIOA_14_NO_REMAP   /**< \brief GPIO */

#define PIOA_14_SWDCLK                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x18, 0)   /**< \brief SWDCLK */
/** @} */

/**
 * \name PIOA_14引脚复用时功能模式
 * @{
 */

#define PIOA_14_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_14_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_14_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_14_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_14_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_14_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_14_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_14_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_14引脚响应速率
 * @{
 */

#define PIOA_14_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOA_14_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOA_14_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOA_15引脚复用功能
 * @{
 */
#define PIOA_15_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOA_15_GPIO                  PIOA_15_NO_REMAP   /**< \brief GPIO */

#define PIOA_15_JTDI                  AM_STM32F103RBT6_GPIO_REMAP_CODE(0x18, 0)   /**< \brief JTDI */
#define PIOA_15_TIM2_CH1_ETR_REMAP1   AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH1_ETR */
#define PIOA_15_TIM2_CH1_ETR_REMAP3   AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH1_ETR */
#define PIOA_15_SPI1_NSS              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_NSS */
/** @} */

/**
 * \name PIOA_15引脚复用时功能模式
 * @{
 */

#define PIOA_15_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOA_15_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOA_15_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOA_15_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOA_15_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOA_15_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOA_15_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOA_15_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOA_15引脚响应速率
 * @{
 */

#define PIOA_15_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOA_15_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOA_15_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_0引脚复用功能
 * @{
 */
#define PIOB_0_NO_REMAP               AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_0_ADC12_IN8              PIOB_0_NO_REMAP   /**< \brief ADC12_IN8 */
#define PIOB_0_GPIO                   PIOB_0_NO_REMAP   /**< \brief GPIO */

#define PIOB_0_TIM3_CH3_REMAP0        AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 0)   /**< \brief TIM3_CH3 */
#define PIOB_0_TIM3_CH3_REMAP2        AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH3 */
#define PIOB_0_TIM1_CH2N_REMAP1       AM_STM32F103RBT6_GPIO_REMAP_CODE(0X06, 1)   /**< \brief TIM1_CH2N */
/** @} */

/**
 * \name PIOB_8引脚复用时功能模式
 * @{
 */

#define PIOB_0_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_0_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_0_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_0_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_0_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_0_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_0_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_0_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_0引脚响应速率
 * @{
 */

#define PIOB_0_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_0_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_0_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_1引脚复用功能
 * @{
 */
#define PIOB_1_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_1_ADC12_IN9             PIOB_1_NO_REMAP   /**< \brief ADC12_IN9 */
#define PIOB_1_GPIO                  PIOB_1_NO_REMAP   /**< \brief GPIO */

#define PIOB_1_TIM3_CH4_REMAP0       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 0)   /**< \brief TIM3_CH4 */
#define PIOB_1_TIM3_CH4_REMAP1       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH4 */
#define PIOB_1_TIM1_CH3N_REMAP1      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x06, 1)   /**< \brief TIM1_CH3N */

/** @} */

/**
 * \name PIOB_1引脚复用时功能模式
 * @{
 */

#define PIOB_1_AIN                  AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_1_INPUT_FLOAT          AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_1_INPUT_PD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_1_INPUT_PU             AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_1_OUT_PP               AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_1_OUT_OD               AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_1_AF_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_1_AF_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_1引脚响应速率
 * @{
 */

