zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
#define PIOB_1_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_1_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_1_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_2引脚复用功能
 * @{
 */
#define PIOB_2_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_2_GPIO                  PIOB_2_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOB_2引脚复用时功能模式
 * @{
 */

#define PIOB_2_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_2_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_2_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_2_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_2_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_2_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_2_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_2_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_2引脚响应速率
 * @{
 */

#define PIOB_2_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_2_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_2_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_3引脚复用功能
 * @{
 */
#define PIOB_3_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_3_GPIO                  PIOB_3_NO_REMAP   /**< \brief GPIO */

#define PIOB_3_TRACESWO              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x18, 0)   /**< \brief TRACESWO */
#define PIOB_3_TIM2_CH2_REMAP1       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 1)   /**< \brief TIM2_CH2 */
#define PIOB_3_TIM2_CH2_REMAP3       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH2 */
#define PIOB_3_SPI1_SCK_REMAP1       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_SCK */

/** @} */

/**
 * \name PIOB_3引脚复用时功能模式
 * @{
 */

#define PIOB_3_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_3_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_3_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_3_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_3_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_3_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_3_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_3_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_3引脚响应速率
 * @{
 */

#define PIOB_3_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_3_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_3_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_4引脚复用功能
 * @{
 */
#define PIOB_4_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_4_GPIO                  PIOB_4_NO_REMAP   /**< \brief GPIO */

#define PIOB_4_TIM3_CH1_REMAP2       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH1 */
#define PIOB_4_SPI1_MISO_REMAP1      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_MISO */
#define PIOB_4_JNTRST                AM_STM32F103RBT6_GPIO_REMAP_CODE(0x18, 0)   /**< \brief JNTRST */
/** @} */

/**
 * \name PIOB_4引脚复用时功能模式
 * @{
 */

#define PIOB_4_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_4_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式(默认) */
#define PIOB_4_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_4_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_4_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_4_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_4_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_4_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_4引脚响应速率
 * @{
 */

#define PIOB_4_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_4_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_4_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_5引脚复用功能
 * @{
 */

#define PIOB_5_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_5_GPIO                  PIOB_5_NO_REMAP   /**< \brief GPIO */
#define PIOB_5_I2C1_SMBAI            PIOB_5_NO_REMAP   /**< \brief I2C1_SMBAI */

#define PIOB_5_TIM3_CH2_REMAP2       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 2)   /**< \brief TIM3_CH2 */
#define PIOB_5_SPI1_MOSI_REMAP1      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x00, 1)   /**< \brief SPI1_MOSI */

/** @} */

/**
 * \name PIOB_5引脚复用时功能模式
 * @{
 */

