zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
#define PIOB_9_NO_REMAP              AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_9_TIM4_CH4              PIOB_9_NO_REMAP   /**< \brief TIM4_CH4 */
#define PIOB_9_GPIO                  PIOB_9_NO_REMAP   /**< \brief GPIO */

#define PIOB_9_I2C1_SDA_REMAP1       AM_STM32F103RBT6_GPIO_REMAP_CODE(0x01, 1)   /**< \brief I2C1_SDA */
#define PIOB_9_CAN_TX_REMAP2         AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0D, 2)   /**< \brief CAN_TX */
#define PIOB_9_TIM4_CH4_REMAP        AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0C, 0)   /**< \brief TIM4_CH4 */

/** @} */

/**
 * \name PIOB_9引脚复用时功能模式
 * @{
 */

#define PIOB_9_AIN                   AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_9_INPUT_FLOAT           AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_9_INPUT_PD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_9_INPUT_PU              AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_9_OUT_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_9_OUT_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_9_AF_PP                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_9_AF_OD                 AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_9引脚响应速率
 * @{
 */

#define PIOB_9_SPEED_10MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_9_SPEED_2MHz            AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_9_SPEED_50MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_10引脚复用功能
 * @{
 */

#define PIOB_10_NO_REMAP             AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_10_I2C2_SCL             PIOB_10_NO_REMAP   /**< \brief I2C2_SCL */
#define PIOB_10_GPIO                 PIOB_10_NO_REMAP   /**< \brief GPIO */

#define PIOB_10_USART3_TX_REMAP0     AM_STM32F103RBT6_GPIO_REMAP_CODE(0x04, 0)   /**< \brief USART3_TX */
#define PIOB_10_TIM2_CH3_REMAP2      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH3 */
#define PIOB_10_TIM2_CH3_REMAP3      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH3 */

/** @} */

/**
 * \name PIOB_10引脚复用时功能模式
 * @{
 */

#define PIOB_10_AIN                  AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_10_INPUT_FLOAT          AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_10_INPUT_PD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_10_INPUT_PU             AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_10_OUT_PP               AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_10_OUT_OD               AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_10_AF_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_10_AF_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_10引脚响应速率
 * @{
 */

#define PIOB_10_SPEED_10MHz          AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_10_SPEED_2MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_10_SPEED_50MHz          AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_11引脚复用功能
 * @{
 */

#define PIOB_11_NO_REMAP             AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_11_I2C2_SDA             PIOB_11_NO_REMAP   /**< \brief I2C2_SDA */
#define PIOB_11_GPIO                 PIOB_11_NO_REMAP   /**< \brief GPIO */

#define PIOB_11_USART3_RX_REMAP0     AM_STM32F103RBT6_GPIO_REMAP_CODE(0x04, 0)   /**< \brief USART3_RX */
#define PIOB_11_TIM2_CH4_REMAP2      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 2)   /**< \brief TIM2_CH4 */
#define PIOB_11_TIM2_CH4_REMAP3      AM_STM32F103RBT6_GPIO_REMAP_CODE(0x08, 3)   /**< \brief TIM2_CH4 */

/** @} */

/**
 * \name PIOB_11引脚复用时功能模式
 * @{
 */

#define PIOB_11_AIN                  AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOB_11_INPUT_FLOAT          AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOB_11_INPUT_PD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOB_11_INPUT_PU             AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOB_11_OUT_PP               AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOB_11_OUT_OD               AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOB_11_AF_PP                AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOB_11_AF_OD                AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOB_11引脚响应速率
 * @{
 */

#define PIOB_11_SPEED_10MHz          AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOB_11_SPEED_2MHz           AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOB_11_SPEED_50MHz          AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOB_12引脚复用功能
 * @{
 */

#define PIOB_12_NO_REMAP             AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOB_12_SPI2_NSS             PIOB_12_NO_REMAP   /**< \brief SPI2_NSS */
#define PIOB_12_I2C2_SMBAI           PIOB_12_NO_REMAP   /**< \brief I2C2_SMBAI */
#define PIOB_12_GPIO                 PIOB_12_NO_REMAP   /**< \brief GPIO */

#define PIOB_12_TIM1_BAKIN_REMAP0    AM_STM32F103RBT6_GPIO_REMAP_CODE(0x06, 0)   /**< \brief TIM1_BAKIN */
#define PIOB_12_USART3_CK_REMAP0     AM_STM32F103RBT6_GPIO_REMAP_CODE(0x04, 0)   /**< \brief USART3_CK */

/** @} */

/**
 * \name PIOB_12引脚复用时功能模式
 * @{
 */

