zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
#define PIOC_0_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_0_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_0_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_0_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_0_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_0_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_0_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_0_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_0引脚响应速率
 * @{
 */

#define PIOC_0_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_0_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_0_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_1引脚复用功能
 * @{
 */
#define PIOC_1_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_1_ADC12_IN11         PIOC_1_NO_REMAP   /**< \brief ADC12_IN11 */
#define PIOC_1_GPIO               PIOC_1_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_1引脚复用时功能模式
 * @{
 */

#define PIOC_1_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_1_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_1_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_1_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_1_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_1_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_1_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_1_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_1引脚响应速率
 * @{
 */

#define PIOC_1_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_1_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_1_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_2引脚复用功能
 * @{
 */
#define PIOC_2_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_2_ADC12_IN12         PIOC_2_NO_REMAP   /**< \brief ADC12_IN12 */
#define PIOC_2_GPIO               PIOC_2_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_2引脚复用时功能模式
 * @{
 */

#define PIOC_2_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_2_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_2_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_2_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_2_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_2_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_2_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_2_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_2引脚响应速率
 * @{
 */

#define PIOC_2_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_2_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_2_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_3引脚复用功能
 * @{
 */

#define PIOC_3_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_3_ADC12_IN13         PIOC_3_NO_REMAP   /**< \brief ADC12_IN13 */
#define PIOC_3_GPIO               PIOC_3_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_3引脚复用时功能模式
 * @{
 */

#define PIOC_3_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_3_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_3_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_3_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_3_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_3_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_3_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_3_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_3引脚响应速率
 * @{
 */

#define PIOC_3_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_3_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_3_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_4引脚复用功能
 * @{
 */

#define PIOC_4_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_4_ADC12_IN14         PIOC_4_NO_REMAP   /**< \brief ADC12_IN14 */
#define PIOC_4_GPIO               PIOC_4_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_4引脚复用时功能模式
 * @{
 */

#define PIOC_4_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_4_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_4_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_4_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_4_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_4_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_4_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_4_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_4引脚响应速率
 * @{
 */

#define PIOC_4_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_4_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_4_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_5引脚复用功能
 * @{
 */

