zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
#define PIOC_5_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_5_ADC12_IN15         PIOC_5_NO_REMAP   /**< \brief ADC12_IN15 */
#define PIOC_5_GPIO               PIOC_5_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_5引脚复用时功能模式
 * @{
 */

#define PIOC_5_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_5_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_5_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_5_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_5_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_5_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_5_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_5_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_5引脚响应速率
 * @{
 */

#define PIOC_5_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_5_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_5_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_6引脚复用功能
 * @{
 */

#define PIOC_6_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_6_GPIO               PIOC_6_NO_REMAP   /**< \brief GPIO */

#define PIOC_6_TIM3_CH1_REMAP3    AM_STM32F103RBT6_GPIO_REMAP_CODE(0X0A, 3)   /**< \brief TIM3_CH1 */

/** @} */

/**
 * \name PIOC_6引脚复用时功能模式
 * @{
 */

#define PIOC_6_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_6_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_6_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_6_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_6_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_6_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_6_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_6_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_6引脚响应速率
 * @{
 */

#define PIOC_6_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_6_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_6_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_7引脚复用功能
 * @{
 */

#define PIOC_7_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_7_GPIO               PIOC_7_NO_REMAP   /**< \brief GPIO */

#define PIOC_7_TIM3_CH2_REMAP3    AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 3)   /**< \brief TIM3_CH2 */

/** @} */

/**
 * \name PIOC_7引脚复用时功能模式
 * @{
 */

#define PIOC_7_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_7_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_7_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_7_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_7_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_7_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_7_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_7_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_7引脚响应速率
 * @{
 */

#define PIOC_7_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_7_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_7_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_8引脚复用功能
 * @{
 */

#define PIOC_8_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_8_GPIO               PIOC_8_NO_REMAP   /**< \brief GPIO */

#define PIOC_8_TIM3_CH3_REMAP3    AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 3)   /**< \brief TIM3_CH3 */

/** @} */

/**
 * \name PIOC_8引脚复用时功能模式
 * @{
 */

#define PIOC_8_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_8_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_8_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_8_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_8_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_8_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_8_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_8_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_8引脚响应速率
 * @{
 */

#define PIOC_8_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_8_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_8_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_9引脚复用功能
 * @{
 */

