zlgopen/ametal/soc/stm/stm32f103rbt6/stm32f103rbt6_pin.h
#define PIOC_9_NO_REMAP           AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_9_GPIO               PIOC_9_NO_REMAP   /**< \brief GPIO */

#define PIOC_9_TIM3_CH4_REMAP3    AM_STM32F103RBT6_GPIO_REMAP_CODE(0x0A, 3)   /**< \brief TIM3_CH4 */

/** @} */

/**
 * \name PIOC_9引脚复用时功能模式
 * @{
 */

#define PIOC_9_AIN                AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_9_INPUT_FLOAT        AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_9_INPUT_PD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_9_INPUT_PU           AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_9_OUT_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_9_OUT_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_9_AF_PP              AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_9_AF_OD              AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_9引脚响应速率
 * @{
 */

#define PIOC_9_SPEED_10MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_9_SPEED_2MHz         AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_9_SPEED_50MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_10引脚复用功能
 * @{
 */

#define PIOC_10_NO_REMAP          AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_10_GPIO              PIOC_10_NO_REMAP   /**< \brief GPIO */

#define PIOC_10_USART3_TX_REMAP1  AM_STM32F103RBT6_GPIO_REMAP_CODE(0x04, 1)   /**< \brief USART3_TX */

/** @} */

/**
 * \name PIOC_10引脚复用时功能模式
 * @{
 */

#define PIOC_10_AIN               AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_10_INPUT_FLOAT       AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_10_INPUT_PD          AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_10_INPUT_PU          AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_10_OUT_PP            AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_10_OUT_OD            AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_10_AF_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_10_AF_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_10引脚响应速率
 * @{
 */

#define PIOC_10_SPEED_10MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_10_SPEED_2MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_10_SPEED_50MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_11引脚复用功能
 * @{
 */

#define PIOC_11_NO_REMAP          AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_11_GPIO              PIOC_11_NO_REMAP   /**< \brief GPIO */

#define PIOC_11_USART3_RX_REMAP1  AM_STM32F103RBT6_GPIO_REMAP_CODE(0x04, 1)   /**< \brief USART3_RX */

/** @} */

/**
 * \name PIOC_11引脚复用时功能模式
 * @{
 */

#define PIOC_11_AIN               AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_11_INPUT_FLOAT       AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_11_INPUT_PD          AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_11_INPUT_PU          AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_11_OUT_PP            AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_11_OUT_OD            AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_11_AF_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_11_AF_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_11引脚响应速率
 * @{
 */

#define PIOC_11_SPEED_10MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_11_SPEED_2MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_11_SPEED_50MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_12引脚复用功能
 * @{
 */

#define PIOC_12_NO_REMAP          AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_12_GPIO              PIOC_12_NO_REMAP   /**< \brief GPIO */

#define PIOC_12_USART3_CK_REMAP1  AM_STM32F103RBT6_GPIO_REMAP_CODE(0x04, 1)   /**< \brief USART3_CK */

/** @} */

/**
 * \name PIOC_12引脚复用时功能模式
 * @{
 */

#define PIOC_12_AIN               AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_12_INPUT_FLOAT       AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_12_INPUT_PD          AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_12_INPUT_PU          AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_12_OUT_PP            AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_12_OUT_OD            AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_12_AF_PP             AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_12_AF_OD             AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_12引脚响应速率
 * @{
 */

#define PIOC_12_SPEED_10MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_12_SPEED_2MHz        AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_12_SPEED_50MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_13引脚复用功能
 * @{
 */

#define PIOC_13_NO_REMAP         AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_13_TAMPER_RTC       PIOC_13_NO_REMAP   /**< \brief TAMPER_RTC */
#define PIOC_13_GPIO             PIOC_13_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_13引脚复用时功能模式
 * @{
 */

#define PIOC_13_AIN              AM_STM32F103RBT6_GPIO_MODE_CODE(0x0)   /**< \brief 模拟模式 */
#define PIOC_13_INPUT_FLOAT      AM_STM32F103RBT6_GPIO_MODE_CODE(0x1)   /**< \brief 输入浮空模式（默认） */
#define PIOC_13_INPUT_PD         AM_STM32F103RBT6_GPIO_MODE_CODE(0x2)   /**< \brief 输入下拉模式 */
#define PIOC_13_INPUT_PU         AM_STM32F103RBT6_GPIO_MODE_CODE(0x3)   /**< \brief 输入上拉模式 */
#define PIOC_13_OUT_PP           AM_STM32F103RBT6_GPIO_MODE_CODE(0x4)   /**< \brief 通用推挽输出模式 */
#define PIOC_13_OUT_OD           AM_STM32F103RBT6_GPIO_MODE_CODE(0x5)   /**< \brief 通用开漏输出模式 */
#define PIOC_13_AF_PP            AM_STM32F103RBT6_GPIO_MODE_CODE(0x6)   /**< \brief 复用推挽输出模式 */
#define PIOC_13_AF_OD            AM_STM32F103RBT6_GPIO_MODE_CODE(0x7)   /**< \brief 复用开漏输出模式 */

/** @} */

/**
 * \name PIOC_13引脚响应速率
 * @{
 */

#define PIOC_13_SPEED_10MHz      AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x01)   /**< \brief 10MHz输出响应速率 */
#define PIOC_13_SPEED_2MHz       AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x02)   /**< \brief 2MHz输出响应速率 */
#define PIOC_13_SPEED_50MHz      AM_STM32F103RBT6_GPIO_OUTRES_RATE_CODE(0x03)   /**< \brief 50MHz输出响应速率 */

/** @} */

/******************************************************************************/

/**
 * \name PIOC_14引脚复用功能
 * @{
 */

#define PIOC_14_NO_REMAP        AM_STM32F103RBT6_GPIO_REMAP_CODE(0x15, 0)
#define PIOC_14_OSC32_IN        PIOC_14_NO_REMAP   /**< \brief OSC32_IN */
#define PIOC_14_GPIO            PIOC_14_NO_REMAP   /**< \brief GPIO */

/** @} */

/**
 * \name PIOC_14引脚复用时功能模式
 * @{
 */

